using System.Collections.Generic;

namespace CoupleTrader.Api.Trade.EsunnyTap.Interop;

public static class ErrorCodeMap
{
    static readonly Dictionary<int, string> s_errorMap = new Dictionary<int, string>
    {
        [0] = "成功",
        [-1] = "连接服务失败",
        [-2] = "链路认证失败",
        [-3] = "主机地址不可用",
        [-4] = "发送数据错误",
        [-5] = "测试编号不合法",
        [-6] = "没准备好测试网络",
        [-7] = "当前网络测试还没结束",
        [-8] = "没用可用的接入前置",
        [-9] = "数据路径不可用",
        [-10] = "重复登录",
        [-11] = "内部错误	",
        [-12] = "上一次请求还没有结束	",
        [-13] = "输入参数非法	",
        [-14] = "授权码不合法	",
        [-15] = "授权码超期	",
        [-16] = "授权码类型不匹配	",
        [-17] = "API还没有准备好",
        [-18] = "UDP端口监听失败",
        [-19] = "UDP正在监听",
        [-20] = "接口未实现",
        [-21] = "每次登陆只允许调用一次",
        [-22] = "操作频率太高",
        [-23] = "信息采集错误",
        [-24] = "信息采集库加载失败",
        [-25] = "非中继模式禁止调用该接口",
        /** @}*/


        //=============================================================================
        /**
         *	\addtogroup G_ERR_INPUT_CHECK		输入参数检查错误
         *	@{
         */
        //=============================================================================
        [-10000] = "输入数据为NULL",
        [-10001] = "输入错误的:TAPIYNFLAG",
        [-10002] = "输入错误的:TAPILOGLEVEL",
        [-10003] = "输入错误的:TAPICommodityType",
        [-10004] = "输入错误的:TAPICallOrPutFlagType",
        [-12001] = "输入错误的:TAPIAccountType",
        [-12003] = "输入错误的:TAPIAccountState",
        [-12004] = "输入错误的:TAPIAccountFamilyType",
        [-12005] = "输入错误的:TAPIOrderTypeType",
        [-12006] = "输入错误的:TAPIOrderSourceType",
        [-12007] = "输入错误的:TAPITimeInForceType",
        [-12008] = "输入错误的:TAPISideType",
        [-12009] = "输入错误的:TAPIPositionEffectType",
        [-12010] = "输入错误的:TAPIHedgeFlagType",
        [-12011] = "输入错误的:TAPIOrderStateType",
        [-12012] = "输入错误的:TAPICalculateModeType",
        [-12013] = "输入错误的:TAPIMatchSourceType",
        [-12014] = "输入错误的:TAPIOpenCloseModeType",
        [-12015] = "输入错误的:TAPIFutureAlgType",
        [-12016] = "输入错误的:TAPIOptionAlgType",
        [-12017] = "输入错误的:TAPIBankAccountLWFlagType",
        [-12021] = "输入错误的:TAPIMarginCalculateModeType",
        [-12022] = "输入错误的:TAPIOptionMarginCalculateModeType",
        [-12023] = "输入错误的:TAPICmbDirectType",
        [-12024] = "输入错误的:TAPIDeliveryModeType",
        [-12025] = "输入错误的:TAPIContractTypeType",
        [-12035] = "输入错误的:TAPITacticsTypeType",
        [-12036] = "输入错误的:TAPIORDERACT",
        [-12041] = "输入错误的:TAPITriggerConditionType",
        [-12042] = "输入错误的:TAPITriggerPriceTypeType",
        [-12043] = "输入错误的:TAPITradingStateType ",
        [-12044] = "输入错误的:TAPIMarketLevelType ",
        [-12045] = "输入错误的:TAPIOrderQryTypeType ",
        /** @}*/

        //=============================================================================
        /**
         *	\addtogroup G_ERR_DISCONNECT_REASON	网络断开错误代码定义
         *	@{
         */
        //=============================================================================
        [1] = "主动断开",
        [2] = "被动断开",
        [3] = "读错误",
        [4] = "写错误",
        [5] = "缓冲区满",
        [6] = "异步操作错误",
        [7] = "解析数据错误",
        [8] = "连接超时",
        [9] = "初始化失败",
        [10] = "已经连接",
        [11] = "工作线程已结束",
        [12] = "操作正在进行，请稍后重试",
        [13] = "心跳检测失败",
        /** @}*/

        //=============================================================================
        /**
         *	\addtogroup G_ERR_LOGIN	登陆过程返回的错误代码定义
         *	@{
         */
        //=============================================================================
        [10001] = "登录过程执行错误",
        [10002] = "登录用户不存在",
        [10003] = "需要进行动态认证",
        [10004] = "登录用户未授权",
        [10005] = "登录模块不正确",
        [10006] = "需要强制修改密码",
        [10007] = "登录状态禁止登陆",
        [10008] = "登录密码不正确",
        [10009] = "没有该模块登录权限",
        [10010] = "登录数量超限",
        [10011] = "登录用户不在服务器标识下可登录用户列表中",
        [10012] = "登陆用户不在有效期",
        [10013] = "登陆用户无下属客户",
        [10014] = "登录用户是子帐号且授权中未包含机构通标记",
        [10015] = "登录用户密码错误次数超限，禁止登陆",
        [10016] = "登录用户授权类型错误",
        [10017] = "登录用户授权到期或到期日错误",
        [10018] = "登录用户密码超过有效天数",
        [10019] = "登录用户未授权的登录IP和MAC",
        [10020] = "8.2客户端禁止登录请升级8.3",
        [10021] = "用户授权信息错误",
        /** @}*/

        //=============================================================================
        /**
         *	\addtogroup G_ERR_MANAGE 管理业务处理返回错误码
         *	@{
         */
        //==============================================================================
        [10101] = "登录用户信息查询失败",
        [11001] = "登录用户下属所有权限查询失败",
        [11501] = "登录用户下属所有资金账号查询失败",
        [11701] = "登录用户密码修改失败",
        [11702] = "登录用户密码修改失败——原始密码错误",
        [11703] = "登录用户密码修改失败——不能与前n次密码相同",
        [11704] = "新密码不符合密码复杂度要求",
        [20201] = "资金账号信息查询失败",
        [20701] = "客户交易编码查询失败",
        [22801] = "合约信息查询失败",
        [22901] = "特殊期权标的查询失败",
        [25501] = "品种委托类型查询失败",
        [25601] = "品种委托时间有效性查询失败",
        [28901] = "用户下单频率查询失败",
        [29591] = "提交信息用户授权类型错误",
        [29592] = "用户采集终端数据为空",
        [29593] = "用户密钥版本错误",
        [29594] = "用户采集信息不全，权限不够",
        /** @}*/

        //=============================================================================
        /**
         *	\addtogroup G_ERR_TRADE 交易业务处理返回错误码
         *	@{
         */
        //==============================================================================
        [60001] = "资金账号不存在",
        [60002] = "资金账号状态不正确",
        [60003] = "资金账号无委托方向交易权限",
        [60004] = "资金账号无期权交易权限",
        [60005] = "资金账号无品种交易权限",
        [60006] = "资金账号无开仓权限",
        [60007] = "资金账号风控项检查失败",
        [60011] = "下单无效的合约",
        [60021] = "下单合约无交易路由",
        [60022] = "持仓量超过最大限制",
        [60023] = "禁止交易",
        [60024] = "只可平仓",
        [60031] = "下单资金不足",
        [60032] = "不支持的订单类型",
        [60033] = "不支持的时间有效类型",
        [60034] = "不支持的策略单类型",
        [60035] = "平仓数量超过已有持仓量",
        [60036] = "下单自动审核失败",
        [60037] = "LME未准备就绪",
        [60038] = "平仓方式错误",
        [60039] = "下单对应的父账号资金不足",
        [60040] = "互换单的合约格式错误",
        [60051] = "当前客户不能使用此账号交易",
        [60052] = "上手通道状态不正常",
        [60053] = "上手通道未开通EXIST",
        [60061] = "撤单无此系统号",
        [60062] = "此状态不允许撤单",
        [60063] = "此状态不允许激活",
        [60064] = "只允许撤销本合约最新一次委托",
        [60071] = "此状态禁止审核",
        [60072] = "订单审核失败",
        [60081] = "此状态不允许改单",
        [60082] = "人工单不允许改单",
        [60091] = "手续费参数错误",
        [60092] = "保证金参数错误",
        [60100] = "操作账号只可查询",
        [60101] = "非做市商不能应价",
        [60102] = "即使子帐号又是做市商不能应价",
        [60103] = "下单找不到交易编码",
        [60104] = "操作账号只可开仓",
        [60105] = "操作账号没有上期挂单查询权限",
        [60106] = "限期有效单不能小于当前交易日",
        [60107] = "该编码不允许申请或拆分组合",
        [60108] = "非本服务器标记下的账号不允许操作",
        [60109] = "行权或弃权量超过可用量",
        [60110] = "没有订单审核权限",
        [60111] = "超过当日最大开仓量",
        [60112] = "涨跌停附近禁止反向开仓",
        [60113] = "超过单笔最大下单量",
        [60114] = "超过最大持仓量",
        [60115] = "非大连应价单不允许两笔委托量不一致",
        [60117] = "申请不允许重复提交",
        [60118] = "超过账号下单频率限制",
        [60119] = "组合表不存在的组合方向或投保标志",
        [60120] = "当前期权存在合理价差不需要询价",
        [60121] = "应价委托价格不合理",
        [60122] = "普通客户不允许撤销强平单",
        [60123] = "应价委托开平标志不正确",
        [61001] = "订单操作频率过高",
        [61002] = "委托查询返回前不能进行下次查询",
        /** @}*/

        //=============================================================================
        /**
         *	\addtogroup G_ERR_QUOTE 行情业务处理返回错误码
         *	@{
         */
        //=============================================================================
        [72001] = "超过行情最大总订阅数",
        [72002] = "超过该交易所行情最大订阅数",
        [72101] = "没有该行情的订阅权限",
        [72102] = "没有该交易所下行情的订阅权限",
        [72103] = "品种不存在",
        [72104] = "合约可能不存在",
        [83001] = "不支持的行情协议",
        [83002] = "行情前置总登录数超限",
        [83003] = "订阅超过订阅数量限制"
    };

    public static string GetErrorMsg(int errorCode)
    {
        return s_errorMap.TryGetValue(errorCode, out var msg) ? $"{errorCode},{msg}" : errorCode.ToString();
    }
}
